src/ut10_old/DataProcessors/СозданиеСчетФактур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>СозданиеСчетФактур</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФактура</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/ut10_old/DataProcessors/СозданиеСчетФактур/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = Справочники.Организации.НайтиПоКоду("000000103");
	//Объект.Контрагент  = Справочники.Контрагенты.НайтиПоКоду("АВ0000254");
	ДатаНач	=	НачалоМесяца(ТекущаяДата());
	ДатаКон	=	КонецМесяца(ТекущаяДата());

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	УслКонтрагент = "";
	Если ЗначениеЗаполнено(Объект.Контрагент) тогда
		УслКонтрагент = " И РеализацияТоваровУслуг.Контрагент = &Контрагент ";
	КонецЕсли;

	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	РеализацияТоваровУслуг.Ссылка
	      	 	             |ПОМЕСТИТЬ Реализации
	      	 	             |ИЗ
	      	 	             |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	      	 	             |ГДЕ
	      	 	             |	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И РеализацияТоваровУслуг.Организация = &Организация
	      	 	             |	И РеализацияТоваровУслуг.Проведен"+УслКонтрагент+"
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	СчетФактураВыданный.Ссылка КАК ДокСф
	      	 	             |ПОМЕСТИТЬ СФ
	      	 	             |ИЗ
	      	 	             |	Документ.СчетФактураВыданный КАК СчетФактураВыданный,
	      	 	             |	Реализации КАК Реализации
	      	 	             |ГДЕ
	      	 	             |	СчетФактураВыданный.Проведен
	      	 	             |	И СчетФактураВыданный.ДокументОснование В (Реализации.Ссылка)
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	Реализации.Ссылка КАК Реализация,
	      	 	             |	СФ.ДокСф КАК СчетФактура
	      	 	             |ИЗ
	      	 	             |	Реализации КАК Реализации
	      	 	             |		ЛЕВОЕ СОЕДИНЕНИЕ СФ КАК СФ
	      	 	             |		ПО Реализации.Ссылка = СФ.ДокСф.ДокументОснование
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	Реализации.Ссылка.Дата");
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ДатаНач",ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон));
	
	Объект.Реализации.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Функция  СоздатьСФВыданныйНаСервере(Реализация)
	
	НоваяСФ = Документы.СчетФактураВыданный.СоздатьДокумент();
	НоваяСФ.Заполнить(Реализация);
	НоваяСФ.ДокументОснование	=	Реализация;
	
	Префикс = ПолучиьПрефикс(Реализация.Дата);
	
	НоваяСФ.УстановитьНовыйНомер(Префикс);
	
	Попытка
		НоваяСФ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	
	Возврат НоваяСФ;	
КонецФункции

&НаКлиенте
Процедура СоздатьСФ(Команда)
	ФормаПрогрессора = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");
	Если ФормаПрогрессора.Открыта() Тогда
		
		ФормаПрогрессора.Закрыть();
	КонецЕсли; 
	
	ФормаПрогрессора.Значение = 0;
	ФормаПрогрессора.КомментарийОбработкиДанных	=	"Создание счет-фактур...";	
	
	ФормаПрогрессора.МаксимальноеЗначение = Объект.Реализации.Количество() + Объект.Поступления.Количество();
	ФормаПрогрессора.Открыть(); 
	
	Для каждого Строка из Объект.Реализации цикл
		Если ЗначениеЗаполнено(Строка.СчетФактура) тогда 
			ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
			Продолжить;
		КонецЕсли;  		
		НоваяСФ 			= СоздатьСФВыданныйНаСервере(Строка.Реализация);		
		Строка.СчетФактура  = НоваяСФ.Ссылка;                    		
		ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
	КонецЦикла;
	
	Если ФормаПрогрессора.Открыта() Тогда  		
		ФормаПрогрессора.Закрыть();
	КонецЕсли;  
КонецПроцедуры

&НаСервере
Функция ПолучиьПрефикс(Дата)
	СтрокаМесяц = Строка(Месяц(Дата));
	Если СтрДлина(СтрокаМесяц) = 1 тогда СтрокаМесяц = "0"+СтрокаМесяц; КонецЕсли; 
	
	СтрокаДень = Строка(День(Дата));
	Если СтрДлина(СтрокаДень) = 1 тогда СтрокаДень = "0"+СтрокаДень; КонецЕсли; 
	
	Префикс = СтрокаМесяц + СтрокаДень;
	
	Возврат Префикс;	
КонецФункции
